# FluidType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FluidType Class
Members See Also
---
Has been extended to provide read and write access to a collection of FluidTemperature objects which represent the fluid's properties at various temperatures.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class FluidType : ElementType, IEnumerable<FluidTemperature>
```

Visual Basic
---
```text
Public Class FluidType _
	Inherits ElementType _
	Implements IEnumerable(Of FluidTemperature)
```

Visual C++
---
```text
public ref class FluidType : public ElementType,
	IEnumerable<FluidTemperature^>
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Plumbing..::..FluidType
# See Also
FluidType Members
Autodesk.Revit.DB.Plumbing Namespace